ChipCE/ESP32-BLE-Gamepad/BleGamepad.cpp
#include <NimBLEDevice.h>
#include <NimBLEUtils.h>
#include <NimBLEServer.h>
#include "NimBLEHIDDevice.h"
#include "HIDTypes.h"
#include "HIDKeyboardTypes.h"
#include <driver/adc.h>
#include "sdkconfig.h"

#include "BleConnectionStatus.h"
#include "BleGamepad.h"
#include "BleGamepadConfiguration.h"

#include <stdexcept>

#if defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define LOG_TAG "BLEGamepad"
#else
#include "esp_log.h"
static const char *LOG_TAG = "BLEGamepad";
#endif

#define SERVICE_UUID_DEVICE_INFORMATION        "180A"      // Service - Device information

#define CHARACTERISTIC_UUID_MODEL_NUMBER       "2A24"      // Characteristic - Model Number String - 0x2A24
#define CHARACTERISTIC_UUID_SOFTWARE_REVISION  "2A28"      // Characteristic - Software Revision String - 0x2A28
#define CHARACTERISTIC_UUID_SERIAL_NUMBER      "2A25"      // Characteristic - Serial Number String - 0x2A25
#define CHARACTERISTIC_UUID_FIRMWARE_REVISION  "2A26"      // Characteristic - Firmware Revision String - 0x2A26
#define CHARACTERISTIC_UUID_HARDWARE_REVISION  "2A27"      // Characteristic - Hardware Revision String - 0x2A27

void (*controlEventCallbackFunc)(std::string);

// TEST
NimBLECharacteristic* aliveCharacteristic = nullptr;
NimBLECharacteristic* controlCharacteristic = nullptr;
NimBLECharacteristic* otaCharacteristic = nullptr;
NimBLECharacteristic* sensorCharacteristic = nullptr;
NimBLECharacteristic* configCharacteristic = nullptr;
NimBLECharacteristic* statusCharacteristic = nullptr;

NimBLEAdvertising *pAdvertising = nullptr;


void ControlCallback::onRead(NimBLECharacteristic* pCharacteristic) {
    std::string valueToSend = "pong";
    pCharacteristic->setValue(valueToSend);
    Serial.print("Characteristic read, value sent: ");
    Serial.println(valueToSend.c_str());
}

void ControlCallback::onWrite(NimBLECharacteristic* pCharacteristic) {
    std::string value = pCharacteristic->getValue();
    Serial.print("Characteristic written: ");
    Serial.println(value.c_str());

    if (controlEventCallbackFunc != nullptr) {
        controlEventCallbackFunc(value);
    }
}

// void AliveCallback::onNotify(NimBLECharacteristic* pCharacteristic) {
//     Serial.println("AliveCallback onNotify");
//     uint8_t packetArray[3];
//     packetArray[0] = ++heartCount;  // シーケンスカウンタ 1byte
//     packetArray[1] = 0xF0;        // デバイス番号 1byte
//     packetArray[2] = 0x04;        // ステータス値 1byte
//     pCharacteristic->setValue(packetArray, sizeof(packetArray));
//     pCharacteristic->notify(); 
// }

void OtaCallback::onRead(NimBLECharacteristic* pCharacteristic) {
    std::string valueToSend = "pong";
    pCharacteristic->setValue(valueToSend);  // Set the value that will be read by the client
}

void OtaCallback::onWrite(NimBLECharacteristic* pCharacteristic) {
    std::string value = pCharacteristic->getValue();
    Serial.print("Characteristic written: ");
    Serial.println(value.c_str());
}

// void SensorCallback::onRead(NimBLECharacteristic* pCharacteristic) {
//     std::string valueToSend = "pong";
//     pCharacteristic->setValue(valueToSend);  // Set the value that will be read by the client
// }

// void SensorCallback::onNotify(NimBLECharacteristic* pCharacteristic) {
//     Serial.println("onNotify");
// }

void ConfigCallback::onRead(NimBLECharacteristic* pCharacteristic) {
    std::string valueToSend = "pong";
    pCharacteristic->setValue(valueToSend);  // Set the value that will be read by the client
}

void ConfigCallback::onWrite(NimBLECharacteristic* pCharacteristic) {
    std::string value = pCharacteristic->getValue();
    Serial.print("Characteristic written: ");
    Serial.println(value.c_str());
}

void StatusCallback::onRead(NimBLECharacteristic* pCharacteristic) {
    std::string valueToSend = "pong";
    pCharacteristic->setValue(valueToSend);  // Set the value that will be read by the client
}

void StatusCallback::onWrite(NimBLECharacteristic* pCharacteristic) {
    std::string value = pCharacteristic->getValue();
    Serial.print("Characteristic written: ");
    Serial.println(value.c_str());
}

void StatusCallback::onNotify(NimBLECharacteristic* pCharacteristic) {
    Serial.println("onNotify");
}

uint8_t tempHidReportDescriptor[150];
int hidReportDescriptorSize = 0;
uint8_t reportSize = 0;
uint8_t numOfButtonBytes = 0;
uint16_t vid;
uint16_t pid;
uint16_t guidVersion;
uint16_t axesMin;
uint16_t axesMax;
uint16_t simulationMin;
uint16_t simulationMax;
std::string modelNumber;
std::string softwareRevision;
std::string serialNumber;
std::string firmwareRevision;
std::string hardwareRevision;

BleGamepad::BleGamepad(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel) : _buttons(),
                                                                                                       _specialButtons(0),
                                                                                                       _x(0),
                                                                                                       _y(0),
                                                                                                       _z(0),
                                                                                                       _rZ(0),
                                                                                                       _rX(0),
                                                                                                       _rY(0),
                                                                                                       _slider1(0),
                                                                                                       _slider2(0),
                                                                                                       _rudder(0),
                                                                                                       _throttle(0),
                                                                                                       _accelerator(0),
                                                                                                       _brake(0),
                                                                                                       _steering(0),
                                                                                                       _hat1(0),
                                                                                                       _hat2(0),
                                                                                                       _hat3(0),
                                                                                                       _hat4(0),
                                                                                                       hid(0)
{
    this->resetButtons();
    this->deviceName = deviceName;
    this->deviceManufacturer = deviceManufacturer;
    this->batteryLevel = batteryLevel;
    this->connectionStatus = new BleConnectionStatus();
}

void BleGamepad::resetButtons()
{
    memset(&_buttons, 0, sizeof(_buttons));
}

void BleGamepad::begin(BleGamepadConfiguration *config)
{
    configuration = *config; // we make a copy, so the user can't change actual values midway through operation, without calling the begin function again

    modelNumber = configuration.getModelNumber();
    softwareRevision = configuration.getSoftwareRevision();
    serialNumber = configuration.getSerialNumber();
    firmwareRevision = configuration.getFirmwareRevision();
    hardwareRevision = configuration.getHardwareRevision();

	vid = configuration.getVid();
	pid = configuration.getPid();
	guidVersion = configuration.getGuidVersion();

