ChipCE/ESP32-BLE-Gamepad/BleGamepad.cpp
    BleGamepadInstance->hid->pnp(0x01, vid, pid, guidVersion);
    BleGamepadInstance->hid->hidInfo(0x00, 0x01);

	// NimBLEDevice::setSecurityAuth(BLE_SM_PAIR_AUTHREQ_BOND);
	NimBLEDevice::setSecurityAuth(true, false, false); // enable bonding, no MITM, no SC


    uint8_t *customHidReportDescriptor = new uint8_t[hidReportDescriptorSize];
    memcpy(customHidReportDescriptor, tempHidReportDescriptor, hidReportDescriptorSize);

    // Testing
    //for (int i = 0; i < hidReportDescriptorSize; i++)
    //    Serial.printf("%02x", customHidReportDescriptor[i]);

    // TEST
    cService->start();

    BleGamepadInstance->hid->reportMap((uint8_t *)customHidReportDescriptor, hidReportDescriptorSize);
    BleGamepadInstance->hid->startServices();

    BleGamepadInstance->onStarted(pServer);

    pAdvertising = pServer->getAdvertising();
    pAdvertising->setAppearance(HID_GAMEPAD);
    pAdvertising->addServiceUUID(BleGamepadInstance->hid->hidService()->getUUID());
    //TEST
    pAdvertising->addServiceUUID(cService->getUUID());

    pAdvertising->start();
    BleGamepadInstance->hid->setBatteryLevel(BleGamepadInstance->batteryLevel);

    ESP_LOGD(LOG_TAG, "Advertising started!");
    vTaskDelay(portMAX_DELAY); // delay(portMAX_DELAY);
}


void BleGamepad::setControlEventCallbackFunction(void (*func)(std::string)){
    controlEventCallbackFunc = func;
}

void BleGamepad::test(void){
    uint8_t currentHeatBeat = ++heartCount;

    Serial.println("AliveCallback onNotify");
    uint8_t packetArray[3];
    packetArray[0] = currentHeatBeat;  // シーケンスカウンタ 1byte
    packetArray[1] = 0xF0;        // デバイス番号 1byte
    packetArray[2] = 0x04;        // ステータス値 1byte
    aliveCharacteristic->setValue(packetArray, sizeof(packetArray));
    aliveCharacteristic->notify(); 
    // aliveCharacteristic->notify();




    const uint8_t SENSOR_RAW_BYTE_SIZE = 2;
    const uint8_t SENSOR_VAL_BYTE_SIZE = 4;

    uint8_t sensorPacketArray[SENSOR_DATA_MAX_PACKAGE_SIZE];

    // [0]: sequence counter
    sensorPacketArray[0] = currentHeatBeat;

    // 16bit int -> 2byteに分割
    int packageOffset = 1;
    for(int sensorIdx = 0; sensorIdx < ADC_CHANNEL_COUNT; sensorIdx++) {
        int packageIdx = packageOffset + sensorIdx * SENSOR_RAW_BYTE_SIZE;
        int16_t adcRaw = (int16_t)random(-32768, 32768);
        sensorPacketArray[packageIdx] = adcRaw  & 0xFF; // low byte
        sensorPacketArray[packageIdx + 1] =  (adcRaw >> 8) & 0xFF; // high byte
    }

    // 32bit float -> 2byteに分割
    packageOffset = packageOffset + ADC_CHANNEL_COUNT * SENSOR_RAW_BYTE_SIZE;
    for(int sensorIdx = 0; sensorIdx < ADC_CHANNEL_COUNT; sensorIdx++) {
        float adcVal = (random(-10000, 10001)) / 100.0;
        int packageIdx = packageOffset + sensorIdx * SENSOR_VAL_BYTE_SIZE;
        unsigned int numAsInt = *((unsigned int*)&adcVal);
        sensorPacketArray[packageIdx] = (numAsInt) & 0xFF;
        sensorPacketArray[packageIdx + 1] = (numAsInt >> 8) & 0xFF;
        sensorPacketArray[packageIdx + 2] = (numAsInt >> 16) & 0xFF;
        sensorPacketArray[packageIdx + 3] = (numAsInt >> 24) & 0xFF;
    }

    packageOffset = packageOffset + ADC_CHANNEL_COUNT * SENSOR_VAL_BYTE_SIZE;

    uint32_t currentMillis = millis();
    sensorPacketArray[packageOffset+0] = currentMillis & 0xFF;
    sensorPacketArray[packageOffset+1] = (currentMillis >> 8) & 0xFF;
    sensorPacketArray[packageOffset+2] = (currentMillis >> 16) & 0xFF;
    sensorPacketArray[packageOffset+3] = (currentMillis >> 24) & 0xFF;

    int realPackageSize = 5 + ADC_CHANNEL_COUNT * SENSOR_RAW_BYTE_SIZE + ADC_CHANNEL_COUNT * SENSOR_VAL_BYTE_SIZE;

    sensorCharacteristic->setValue(sensorPacketArray, realPackageSize);
    sensorCharacteristic->notify(); 
}

void BleGamepad::bleBackgroundTask(){
    if (this->connectionStatus->connected)
        if (!pAdvertising->isAdvertising())
            pAdvertising->start();
}